const salesData = [
  { date: "2025-10-07", categories: { "Электроника": 1600, "Одежда": 700, "Книги": 500 } },
  { date: "2025-10-08", categories: { "Электроника": 1200, "Одежда": 850, "Книги": 400 } },
  { date: "2025-10-09", categories: { "Электроника": 1400, "Одежда": 600, "Книги": 350 } },
  { date: "2025-10-10", categories: { "Электроника": 1700, "Одежда": 500, "Книги": 450 } },
  { date: "2025-10-11", categories: { "Электроника": 1300, "Одежда": 700, "Книги": 400 } },
  { date: "2025-10-12", categories: { "Электроника": 1500, "Одежда": 400, "Книги": 500 } },
  { date: "2025-10-13", categories: { "Электроника": 1800, "Одежда": 600 } },
  { date: "2025-10-14", categories: { "Электроника": 1200, "Одежда": 500, "Книги": 300 } },
  { date: "2025-10-15", categories: { "Электроника": 1600, "Одежда": 750, "Книги": 350 } },
  { date: "2025-10-16", categories: { "Электроника": 1400, "Одежда": 600 } },
  { date: "2025-10-17", categories: { "Электроника": 1500, "Одежда": 650, "Книги": 400 } },
  { date: "2025-10-18", categories: { "Электроника": 1700, "Одежда": 500 } },
  { date: "2025-10-19", categories: { "Электроника": 1300, "Книги": 550 } },
  { date: "2025-10-20", categories: { "Электроника": 1600, "Одежда": 700, "Книги": 300 } },
  { date: "2025-10-21", categories: { "Электроника": 1500, "Одежда": 450 } },
  { date: "2025-10-22", categories: { "Электроника": 1800, "Книги": 600 } },
  { date: "2025-10-23", categories: { "Электроника": 1400, "Одежда": 500, "Книги": 350 } },
  { date: "2025-10-24", categories: { "Электроника": 1600, "Одежда": 750 } },
  { date: "2025-10-25", categories: { "Электроника": 1500, "Книги": 400 } },
  { date: "2025-10-26", categories: { "Электроника": 1700, "Одежда": 650, "Книги": 500 } },
  { date: "2025-10-27", categories: { "Электроника": 1300, "Одежда": 500 } },
  { date: "2025-10-28", categories: { "Электроника": 1600, "Книги": 600 } },
  { date: "2025-10-29", categories: { "Электроника": 1400, "Одежда": 700, "Книги": 350 } },
  { date: "2025-10-30", categories: { "Электроника": 1500, "Одежда": 500 } },
  { date: "2025-10-31", categories: { "Электроника": 1800, "Книги": 550 } },
  { date: "2025-11-01", categories: { "Электроника": 1600, "Одежда": 600, "Книги": 400 } },
  { date: "2025-11-02", categories: { "Электроника": 1400, "Одежда": 500 } },
  { date: "2025-11-03", categories: { "Электроника": 1500, "Одежда": 700, "Книги": 300 } },
  { date: "2025-11-04", categories: { "Электроника": 1700, "Книги": 450 } },
  { date: "2025-11-05", categories: { "Электроника": 1300, "Одежда": 600 } },
  { date: "2025-11-06", categories: { "Электроника": 1500, "Одежда": 450, "Книги": 500 } },
  { date: "2025-11-07", categories: { "Электроника": 1800, "Книги": 600 } },
  { date: "2025-11-08", categories: { "Электроника": 1400, "Одежда": 500 } },
  { date: "2025-11-09", categories: { "Электроника": 1600, "Одежда": 750, "Книги": 350 } },
  { date: "2025-11-10", categories: { "Электроника": 1500, "Книги": 400 } },
  { date: "2025-11-11", categories: { "Электроника": 1700, "Одежда": 650 } },
  { date: "2025-11-12", categories: { "Электроника": 1300, "Одежда": 500, "Книги": 450 } },
  { date: "2025-11-13", categories: { "Электроника": 1600, "Книги": 600 } },
  { date: "2025-11-14", categories: { "Электроника": 1400, "Одежда": 700 } },
  { date: "2025-11-15", categories: { "Электроника": 1500, "Одежда": 500, "Книги": 300 } },
  { date: "2025-11-16", categories: { "Электроника": 1800, "Книги": 550 } }
];


export default defineEventHandler(async (event) => {
  const body = await readBody<{ startDate: string; endDate: string }>(event)

  const { startDate, endDate } = body

  if (!startDate || !endDate) {
    return { error: 'Не переданы даты' }
  }

  const filteredData = salesData.filter(item => {
    return item.date >= startDate && item.date <= endDate
  })
  return { data: filteredData }
});