

const salesData = [
  { date: "2024-10-01", categories: { "Электроника": 1200, "Одежда": 800, "Книги": 500 } },
  { date: "2024-10-02", categories: { "Электроника": 1500, "Книги": 600 } },
  { date: "2024-10-03", categories: { "Электроника": 2000, "Одежда": 900 } },
  { date: "2024-10-04", categories: { "Электроника": 1100, "Книги": 700 } },
  { date: "2024-10-05", categories: { "Электроника": 1300, "Одежда": 450, "Книги": 300 } },
  { date: "2024-10-06", categories: { "Электроника": 900, "Одежда": 700, "Книги": 400 } },
  { date: "2024-10-07", categories: { "Электроника": 1600, "Книги": 500 } },
  { date: "2024-10-08", categories: { "Электроника": 1200, "Одежда": 850 } },
  { date: "2024-10-09", categories: { "Электроника": 1400, "Одежда": 600, "Книги": 350 } },
  { date: "2024-10-10", categories: { "Электроника": 1700, "Книги": 450 } },
  { date: "2024-10-11", categories: { "Электроника": 1300, "Одежда": 700 } },
  { date: "2024-10-12", categories: { "Электроника": 1500, "Одежда": 400, "Книги": 500 } },
  { date: "2024-10-13", categories: { "Электроника": 1800, "Книги": 600 } },
  { date: "2024-10-14", categories: { "Электроника": 1200, "Одежда": 500 } },
  { date: "2024-10-15", categories: { "Электроника": 1600, "Одежда": 750, "Книги": 300 } },
  { date: "2024-10-16", categories: { "Электроника": 1400, "Книги": 450 } },
  { date: "2024-10-17", categories: { "Электроника": 1500, "Одежда": 600 } },
  { date: "2024-10-18", categories: { "Электроника": 1700, "Одежда": 500, "Книги": 400 } },
  { date: "2024-10-19", categories: { "Электроника": 1300, "Книги": 550 } },
  { date: "2024-10-20", categories: { "Электроника": 1600, "Одежда": 700 } },
  { date: "2024-10-21", categories: { "Электроника": 1500, "Одежда": 450, "Книги": 500 } },
  { date: "2024-10-22", categories: { "Электроника": 1800, "Книги": 600 } },
  { date: "2024-10-23", categories: { "Электроника": 1400, "Одежда": 500 } },
  { date: "2024-10-24", categories: { "Электроника": 1600, "Одежда": 750, "Книги": 350 } },
  { date: "2024-10-25", categories: { "Электроника": 1500, "Книги": 400 } },
  { date: "2024-10-26", categories: { "Электроника": 1700, "Одежда": 650 } },
  { date: "2024-10-27", categories: { "Электроника": 1300, "Одежда": 500, "Книги": 450 } },
  { date: "2024-10-28", categories: { "Электроника": 1600, "Книги": 600 } },
  { date: "2024-10-29", categories: { "Электроника": 1400, "Одежда": 700 } },
  { date: "2024-10-30", categories: { "Электроника": 1500, "Одежда": 500, "Книги": 300 } },
  { date: "2024-10-31", categories: { "Электроника": 1800, "Книги": 550 } }
];

export default defineEventHandler(async (event) => {
  const body = await readBody<{ startDate: string; endDate: string }>(event)

  const { startDate, endDate } = body

  if (!startDate || !endDate) {
    return { error: 'Не переданы даты' }
  }

  const filteredData = salesData.filter(item => {
    return item.date >= startDate && item.date <= endDate
  })
  return { data: filteredData }
});